Revit 2027 API
FabricRoundingManager.ApplicableSegmentLengthRoundingMethod Property
 The applicable rounding method for fabric segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoundingMethod ApplicableSegmentLengthRoundingMethod { get; }
Public ReadOnly Property ApplicableSegmentLengthRoundingMethod As RoundingMethod
	Get
public:
property RoundingMethod ApplicableSegmentLengthRoundingMethod {
	RoundingMethod get ();
}
member ApplicableSegmentLengthRoundingMethod : RoundingMethod with get
Property Value
RoundingMethod
Remarks
 IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableSegmentLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
See Also
Reference
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace